In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 路路路路

'Connected: root@sakila'

In [3]:
# 1. List the number of films per category.

In [3]:
%%sql
select C.name as category_name, count(*) as num_films  
from category C
join film_category B
on C.category_id = B.category_id
group by name
order by num_films desc
;

 * mysql+pymysql://root:***@localhost/sakila
16 rows affected.

[('Sports', 74),
 ('Foreign', 73),
 ('Family', 69),
 ('Documentary', 68),
 ('Animation', 66),
 ('Action', 64),
 ('New', 63),
 ('Drama', 62),
 ('Games', 61),
 ('Sci-Fi', 61),
 ('Children', 60),
 ('Comedy', 58),
 ('Classics', 57),
 ('Travel', 57),
 ('Horror', 56),
 ('Music', 51)]

In [3]:
# 2. Display the first and the last names, as well as the address, of each staff member.

In [4]:
%%sql
select S.first_name, S.last_name, A.address
from staff S
join address A
on S.address_id = A.address_id
;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Mike', 'Hillyer', '23 Workhaven Lane'),
 ('Jon', 'Stephens', '1411 Lillydale Drive'),
 ('TAMMY', 'SANDERS', '1551 Rampur Lane'),
 ('TAMMY', 'SANDERS', '1551 Rampur Lane'),
 ('TAMMY', 'SANDERS', '1551 Rampur Lane')]

In [3]:
# 3. Display the total amount rung up by each staff member in August 2005.

In [11]:
%%sql
select S.staff_id, concat(s.first_name, '', s.last_name) as name, sum(P.amount) as total_amount
from payment as P
join staff as S
on S.staff_id = P.staff_id
where month(P.payment_date) = 8 and year(p.payment_date) = 2005
group by S.staff_id;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'MikeHillyer', Decimal('11853.65')),
 (2, 'JonStephens', Decimal('12216.49'))]

In [3]:
# 4. List all films and the number of actors who are listed for each film.

In [23]:
%%sql
select F.film_id, F.title, count(A.actor_id) as 'number_of_actors' 
from film_actor as A
join film as F
on A.film_id = F.film_id
group by F.film_id
limit 5
;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 10),
 (2, 'ACE GOLDFINGER', 4),
 (3, 'ADAPTATION HOLES', 5),
 (4, 'AFFAIR PREJUDICE', 5),
 (5, 'AFRICAN EGG', 5)]

In [3]:
# 5. Using the payment and the customer tables as well as the JOIN command, list the total amount paid by each customer. List the customers alphabetically by their last names.

In [34]:
%%sql
select C.first_name, C.last_name, sum(P.amount) as T_paid
from customer as C
join payment as P
on C.customer_id = P.customer_id
group by P.customer_id
order by C.last_name asc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('RAFAEL', 'ABNEY', Decimal('97.79')),
 ('NATHANIEL', 'ADAM', Decimal('133.72')),
 ('KATHLEEN', 'ADAMS', Decimal('92.73')),
 ('DIANA', 'ALEXANDER', Decimal('105.73')),
 ('GORDON', 'ALLARD', Decimal('160.68'))]